//----------------------------
//Что такое программа, UI, данные. 
//програмирование процесс создание программы
//Программа - набор инсрукции и команд, синтаксических конструкций который понимает компьютер
//Данные первичные - т.к. задача любой программы обрабатывать данные
//CRUD операций - create update delete
// Наше приложение визуализирует данные - 
//далее пользователь взаимодействует с данными через user interface
//данные лежат в базах данных и наша программа делает запрос чтобы получить данные

//------------------------------
//Браузер, первая программа
alert('hello world')

//------------------------------
//Примитивные типы данных, теория. JavaScript с нуля.
//number string boolean