/* 
Дополнительные материалы (примеры кода, упражнения и т.п.) для этой книги доступны для загрузки по ссылке h t t p s : //g it h u b .c o m /d a v id f la n a g a n /
j s t d g 7 или на веб-странице русского издания книги по адресу: h t t p : / /
w w w .w illia m sp u b lish in g .c o m /B o o k s/9 7 8 -5 ~ 9 0 7 2 0 3 -7 9 -2 .h tm l.
*/

//JavaScript — высокоуровневый, динамический, интерпретируемый язык программирования, который хорошо подходит для объектно - ориентированного и функционального стилей программирования

//---------------------
// Комментарии
// Это однострочный комментарий
/*
* Это многострочный комментарий. Добавочные символы * в начале каждой
* строки не являются обязательной частью синтаксиса;
* просто они классно выглядят!
*/

//--------------------
//Литералы
//значение данных, находящееся прямо в программе
12 // Число двенадцать
1.2 // Число одна целая и две десятых
"hello world" // Строка текста
'Hi' // Еще одна строка
true // Булевское значение
false // Другое булевское значение
null // Отсутствие объе

//--------------------
//Идентификаторы и зарезервированные слова

my_variable_name
_dummy

//избегать применения любого иp слов в качестве идентификаторов

//--------------------
// Unicode
//программисты могут применять в качестве констант и переменных математические символы и неанглоязычные слова
const п = 3.14;
const si = true;

//-------------------
//Необязательные точки с запятой
а = 3;
b = 4;

//Однако при следующей записи первая точка с запятой обязательна:
а = 3; b = 4;

let а
а
3
console.log(а)//3

let х = 0 // Точка с запятой здесь опущена
;[х, х + 1, х + 2].forEach(console.log) //Защитная ; сохраняет этот
//45